D_A_T/API_FUNCS/SOAPTemps/GetNID.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eng="http://teradata.com/rta/engagementPlatform">
   <soapenv:Header/>
   <soapenv:Body>
      <eng:serviceInquiryRequest>
      <eng:G2GHeader>
            <eng:correlationId>APIsAutomationTesting</eng:correlationId>
            <eng:originatingChannel>?</eng:originatingChannel>
            <eng:channelRequestId>?</eng:channelRequestId>
            <eng:originatingUserType>?</eng:originatingUserType>
            <eng:originatingUserIdentifier>?</eng:originatingUserIdentifier>
            <eng:serviceSlug>ServiceSlug_value</eng:serviceSlug>
         </eng:G2GHeader>
         <eng:serviceID>GetNID</eng:serviceID>
         <eng:clientID>DigitalIdentity</eng:clientID>
         <eng:parameters>
            <eng:parameter>
               <eng:key>HASHED_NATIONALID</eng:key>
               <eng:value>HASHED_NATIONALID_Value</eng:value>
            </eng:parameter>
         </eng:parameters>
      </eng:serviceInquiryRequest>
   </soapenv:Body>
</soapenv:Envelope>